package chapterTwo;

public class Day2 {
//	자료구조 : 데이터를 효율적으로 저장, 접근, 수정하기 위한 그릇
	
//	1. 배열과 리스트 -> 배열과 리스트의 특징을 정확하게 이해
	/*
	배열 : 메모리의 연속 공간에 값이 채워져 있는 형태의 자료구조
	배열의 특징	  
		- 배열의 값은 인덱스를 통해 바로 참조 가능 
		- 새로운 값을 삽입하거나 특정 인덱스에 있는 값을 삭제하기 어려움
		   (값을 삽입하거나 삭제하려면 해당 인덱스 주변에 있는 값을 이동시키는 과정이 필요)
		- 배열의 크기는 선언할 때 지정할 수 있으며, 한 번 선언하면 변경 불가능
	
	리스트 : 값과 포인터를 묶은 노드라는 것을 연결한 자료구조
	리스트의 특징
		- 인덱스가 없으므로 값에 접근하려면 Head 포인터부터 순서대로 접근해야함
		   (접근하는 속도가 느리다)
		- 포인터로 연결되어 있으므로 데이터를 삽입하거나 삭제하는 연산 속도가 빠르다.
		- 선언할 때 크기를 별도로 지정x
		- 포인터로 저장할 공간이 필요하므로 배열보다 구조가 복잡
	*/
	
	
	
}
